stress.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
      name: '1 per second'
    - duration: 10
      arrivalRate: 10
      name: '10 per second'
    - duration: 10
      arrivalRate: 100
      name: '100 per second'
    - duration: 10
      arrivalRate: 1000
      name: '1,000 per second'
  processor: "./dataGeneration/datagen.js"
scenarios:
  - name: "GET testing"
    flow:
    - function: "randomRentalId"
    - get:
        url: "/?id={{id}}"
  - name: "POST testing"
    flow:
    - function: "generateNewRentalWithDates"
    - post:
        url: "/api/rentals"
        json:
          price: "{{price}}"
          max_guests: "{{max_guests}}"
          reviews: "{{reviews}}"
          fees: "{{fees}}"
          availability: "{{availability}}"